Edited/GetMethods_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <MultiSpeakMsgHeader Company="" UserID="" Pwd="" xmlns="http://www.multispeak.org/Version_4.1_Release" />
  </soap:Header>
  <soap:Body>
    <GetMethods xmlns="http://www.multispeak.org/Version_4.1_Release" />
  </soap:Body>
</soap:Envelope>